Revit 2026 API

# WireSizeSetForwardIterator Method

---

Retrieve a forward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual WireSizeSetIterator ForwardIterator()
```
```vb
Public Overridable Function ForwardIterator As WireSizeSetIterator
```
```cpp
public:
virtual WireSizeSetIterator^ ForwardIterator()
```
```fsharp
abstract ForwardIterator : unit -> WireSizeSetIterator
override ForwardIterator : unit -> WireSizeSetIterator
```

#### Return Value

WireSizeSetIteratorReturns a forward moving iterator to the set.

#### Reference

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace